Documents/ВводПоказанийПриборовЗаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводПоказанийПриборовЗаМесяц</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПоказанияПриборовЗаМесяц</xr:Item>
				<xr:Item>AccumulationRegister.РасчетПоказанийПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>InformationRegister.ЗаданияНаСнятиеПоказанийПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектЛицевогоСчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственныйВладелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТарифа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказаниеПредыдущее</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отключен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаПериодРасчета</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереходЧерезНоль</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Источник</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бойлер</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеЖивут</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачислениеПоСреднему</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодКОАТУУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчетаССайта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчетаССайта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СнятыеПоказанияПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СнятыеПоказанияПриборовУчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСМобильнымиУстройствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПУИзВнешнихИсточников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПУИзВнешнихИсточников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПоказанияПриборовУчетаИзТелеграмм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ПоказанияПриборовУчетаИзТелеграмм</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаменыПриборовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаменыПриборовУчета</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПоказаниеПредыдущее</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОтветственныйВладелецЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныйВладелецЛицевогоСчета</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ВводПоказанийПриборовЗаМесяц/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные)
	
	СтруктураДанные = Справочники.ПриборыУчета.ПолучитьРасход(СтруктураДанные);
	
	Возврат СтруктураДанные;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьСоВсехИсточниковНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.ВидТарифа,
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.Значение,
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.СайтЖКХ) КАК Источник
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчетаССайта.СрезПоследних(
		|			&ДатаКон,
		|			ПриборУчета В (&ПриборыУчета)
		|				И ЛицевойСчет В (&ЛицевыеСчета)) КАК ПоказанияПриборовУчетаССайтаСрезПоследних
		|ГДЕ
		|	ПоказанияПриборовУчетаССайтаСрезПоследних.Период >= &ДатаНач
		|	И ПоказанияПриборовУчетаССайтаСрезПоследних.Период <= &ДатаКон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.ПриборУчета,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыТарифов.Общий),
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.Значение,
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.Период,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.МобильноеПриложение)
		|ИЗ
		|	РегистрСведений.СнятыеПоказанияПриборовУчета.СрезПоследних(&ДатаКон, ПриборУчета В (&приборыУчета)) КАК СнятыеПоказанияПриборовУчетаСрезПоследних
		|ГДЕ
		|	СнятыеПоказанияПриборовУчетаСрезПоследних.Период >= &ДатаНач
		|	И СнятыеПоказанияПриборовУчетаСрезПоследних.Период <= &ДатаКон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.ПриборУчета,
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.ВидТарифа,
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.Значение,
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.Период,
		|	ВЫБОР
		|		КОГДА ПоказанияПУИзВнешнихИсточниковСрезПоследних.Источник = ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.ТаблицаExcel)
		|		ИНАЧЕ ПоказанияПУИзВнешнихИсточниковСрезПоследних.Источник
		|	КОНЕЦ
		|ИЗ
		|	РегистрСведений.ПоказанияПУИзВнешнихИсточников.СрезПоследних(&ДатаКон, ПриборУчета В (&ПриборыУчета)) КАК ПоказанияПУИзВнешнихИсточниковСрезПоследних
		|ГДЕ
		|	ПоказанияПУИзВнешнихИсточниковСрезПоследних.Период >= &ДатаНач
		|	И ПоказанияПУИзВнешнихИсточниковСрезПоследних.Период <= &ДатаКон
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПоказанияПриборовУчетаИзТелеграммСрезПоследних.ПриборУчета,
		|	ПоказанияПриборовУчетаИзТелеграммСрезПоследних.ВидТарифа,
		|	ПоказанияПриборовУчетаИзТелеграммСрезПоследних.Значение,
		|	NULL,
		|	ЗНАЧЕНИЕ(Перечисление.ИсточникиПоказаний.Телеграм)
		|ИЗ
		|	РегистрСведений.ПоказанияПриборовУчетаИзТелеграмм.СрезПоследних КАК ПоказанияПриборовУчетаИзТелеграммСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.ПриборУчета КАК ПриборУчета,
		|	ВТ.ВидТарифа КАК ВидТарифа,
		|	ВТ.Значение,
		|	ВТ.Период КАК Период,
		|	ВТ.Источник
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПриборУчета,
		|	ВидТарифа,
		|	Период УБЫВ
		|ИТОГИ ПО
		|	ПриборУчета,
		|	ВидТарифа";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаКон", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ПриборыУчета", Объект.Показания.Выгрузить().ВыгрузитьКолонку("ПриборУчета"));
	Запрос.УстановитьПараметр("ЛицевыеСчета", Объект.Показания.Выгрузить().ВыгрузитьКолонку("ЛицевойСчет"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПрибор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока  ВыборкаПрибор.Следующий() Цикл
		ВыборкаТариф = ВыборкаПрибор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока  ВыборкаТариф.Следующий() Цикл
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("ПриборУчета",ВыборкаТариф.ПриборУчета);
			СтруктураПоиска.Вставить("ВидТарифа",ВыборкаТариф.ВидТарифа);
			ВыборкаДетальныеЗаписи = ВыборкаТариф.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				НайденныеСтроки = Объект.Показания.НайтиСтроки(СтруктураПоиска);
				Для каждого Строка Из НайденныеСтроки Цикл
				
					Если Строка.Отключен Тогда
						Продолжить;
					КонецЕсли;
					Если Строка.Показание <= ВыборкаДетальныеЗаписи.значение Тогда
					    Строка.Показание = ВыборкаДетальныеЗаписи.значение;
					КонецЕсли;
					СтруктураДанные = Новый Структура();
					СтруктураДанные.Вставить("ПриборУчета", Строка.ПриборУчета);
					СтруктураДанные.Вставить("ПредыдущееПоказание", Строка.ПоказаниеПредыдущее);
					СтруктураДанные.Вставить("ТекущееПоказание", Строка.Показание);
					
					СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
					
					Если ЗначениеЗаполнено(СтруктураДанные.ТекстОшибки) Тогда
						
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураДанные.ТекстОшибки);
						
						Строка.Показание = ПоказаниеПередРедактированием;
						
						Возврат;
					КонецЕсли;
					Строка.Источник = ВыборкаДетальныеЗаписи.Источник;
					Строка.Разница = СтруктураДанные.РасходПоПриборуУчета;
					Строка.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
					Строка.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
					Прервать;
				
				КонецЦикла; 
				
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоВсехИсточников(Команда)
	ЗаполнитьСоВсехИсточниковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАвтоматическиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаменыПриборовУчетаОбороты.ОбъектУстановки КАК ОбъектУстановки,
		|	ЗаменыПриборовУчетаОбороты.ПриборУчета КАК ПриборУчета,
		|	ЗаменыПриборовУчетаОбороты.Услуга КАК Услуга,
		|	ЗаменыПриборовУчетаОбороты.ВидТарифа КАК ВидТарифа,
		|	ЗаменыПриборовУчетаОбороты.ПоказаниеПредыдущееОборот КАК ПоказаниеПредыдущееОборот,
		|	ЗаменыПриборовУчетаОбороты.ПоказаниеОборот КАК ПоказаниеОборот,
		|	ЕСТЬNULL(ЗаменыПриборовУчетаОбороты.СреднемесячноеПоказаниеОборот, 0) КАК СреднемесячноеПоказаниеОборот,
		|	ЗаменыПриборовУчетаОбороты.Период КАК Период,
		|	ЗаменыПриборовУчетаОбороты.ОбъектУстановки.ОбъектЛицевогоСчета КАК ОбъектЛицевогоСчета,
		|	ЗаменыПриборовУчетаОбороты.ПриборУчета.Коэффициент КАК Коэффициент,
		|	ЗаменыПриборовУчетаОбороты.ОбъектУстановки.КодКОАТУУ
		|ПОМЕСТИТЬ Замена
		|ИЗ
		|	РегистрНакопления.ЗаменыПриборовУчета.Обороты(&НачПериода, &КонПериода, Месяц, ) КАК ЗаменыПриборовУчетаОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Замена.ОбъектУстановки,
		|	Замена.ПриборУчета,
		|	Замена.Услуга,
		|	Замена.ВидТарифа,
		|	Замена.ПоказаниеПредыдущееОборот КАК ПоказаниеПредыдущее,
		|	Замена.ПоказаниеОборот КАК Показание,
		|	Замена.СреднемесячноеПоказаниеОборот КАК СреднемесячноеПоказание,
		|	Замена.Период,
		|	Замена.ОбъектЛицевогоСчета,
		|	Замена.Коэффициент,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	ИСТИНА КАК Отключен,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Бойлер,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.НеЖивут,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.КодКОАТУУ
		|ПОМЕСТИТЬ ВТ2
		|ИЗ
		|	Замена КАК Замена
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
		|				&КонПериода,
		|				ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						Замена.ОбъектУстановки
		|					ИЗ
		|						Замена КАК Замена)) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО Замена.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановленныеПриборыУчетаСрезПоследних.Период,
		|	УстановленныеПриборыУчетаСрезПоследних.Регистратор,
		|	УстановленныеПриборыУчетаСрезПоследних.НомерСтроки,
		|	УстановленныеПриборыУчетаСрезПоследних.Активность,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
		|	УстановленныеПриборыУчетаСрезПоследних.Действует,
		|	УстановленныеПриборыУчетаСрезПоследних.СреднемесячноеПоказание,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.Бойлер,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.НеЖивут,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки.КодКОАТУУ
		|ПОМЕСТИТЬ УстПУ
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&КонПериода, ) КАК УстановленныеПриборыУчетаСрезПоследних
		|ГДЕ
		|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстПУ.ОбъектУстановки,
		|	УстПУ.ПриборУчета,
		|	ПоказанияПриборовУчетаСрезПоследних.ПриборУчета.Услуга,
		|	ПоказанияПриборовУчетаСрезПоследних.ВидТарифа,
		|	ПоказанияПриборовУчетаСрезПоследних.Значение,
		|	0 КАК ПоказаниеПредыдущее,
		|	ЛОЖЬ КАК Отключен,
		|	УстПУ.ОбъектУстановки.ОбъектЛицевогоСчета,
		|	УстПУ.ПриборУчета.Коэффициент,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	0 КАК СреднемесячноеПоказание,
		|	ПоказанияПриборовУчетаСрезПоследних.Период,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Бойлер,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.НеЖивут,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.КодКОАТУУ
		|ПОМЕСТИТЬ ВТ_тек
		|ИЗ
		|	УстПУ КАК УстПУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
		|				&КонПериода,
		|				Регистратор <> &Ссылка
		|					И ПриборУчета В
		|						(ВЫБРАТЬ
		|							УстПУ.ПриборУчета
		|						ИЗ
		|							УстПУ КАК УстПУ)) КАК ПоказанияПриборовУчетаСрезПоследних
		|		ПО УстПУ.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
		|				&КонПериода,
		|				ЛицевойСчет В
		|					(ВЫБРАТЬ
		|						УстПУ.ОбъектУстановки
		|					ИЗ
		|						УстПУ КАК УстПУ)) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстПУ.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	УстПУ.Действует = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ2.ОбъектУстановки,
		|	ВТ2.ПриборУчета,
		|	ВТ2.Услуга,
		|	ВТ2.ВидТарифа,
		|	ВТ2.ПоказаниеПредыдущее,
		|	ВТ2.Показание,
		|	ВТ2.СреднемесячноеПоказание,
		|	ВТ2.Период,
		|	ВТ2.ОбъектЛицевогоСчета,
		|	ВТ2.Коэффициент,
		|	ВТ2.ОтветственныйВладелец,
		|	ВТ2.Отключен,
		|	ВТ2.ОбъектУстановки.Бойлер,
		|	ВТ2.ОбъектУстановки.НеЖивут,
		|	ВТ2.ЛицевойСчетКодКОАТУУ
		|ИЗ
		|	ВТ2 КАК ВТ2
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_тек.ОбъектУстановки,
		|	ВТ_тек.ПриборУчета,
		|	ВТ_тек.ПриборУчетаУслуга,
		|	ВТ_тек.ВидТарифа,
		|	ВТ_тек.Значение,
		|	ВТ_тек.ПоказаниеПредыдущее,
		|	ВТ_тек.СреднемесячноеПоказание,
		|	ВТ_тек.Период,
		|	ВТ_тек.ОбъектУстановкиОбъектЛицевогоСчета,
		|	ВТ_тек.ПриборУчетаКоэффициент,
		|	ВТ_тек.ОтветственныйВладелец,
		|	ВТ_тек.Отключен,
		|	ВТ_тек.ОбъектУстановки.Бойлер,
		|	ВТ_тек.ОбъектУстановки.НеЖивут,
		|	ВТ_тек.ЛицевойСчетКодКОАТУУ
		|ИЗ
		|	ВТ_тек КАК ВТ_тек
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОтключения,
		|	ЕСТЬNULL(НАПоверке.СреднемесячноеПоказание, 0) КАК СреднемесячноеПоказание,
		|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки КАК ОбъектУстановки,
		|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
		|	ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаВключения,
		|	ЕСТЬNULL(ВЫБОР
		|			КОГДА ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|					И ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|				ТОГДА ВЫБОР
		|						КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|							ТОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ)
		|						ИНАЧЕ РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), ДЕНЬ)
		|					КОНЕЦ
		|			ИНАЧЕ ВЫБОР
		|					КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|							И ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|						ТОГДА РАЗНОСТЬДАТ(ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ)
		|					ИНАЧЕ ВЫБОР
		|							КОГДА ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) > ЕСТЬNULL(УстановленныеПриборыУчетаСрезПоследних.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|									И ЕСТЬNULL(НАПоверке.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) < НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ)
		|								ТОГДА РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ)
		|						КОНЕЦ
		|				КОНЕЦ
		|		КОНЕЦ, 0) КАК ДнейПоСредней,
		|	РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(НАЧАЛОПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ), НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&КонПериода, МЕСЯЦ), ДЕНЬ), ДЕНЬ) КАК ДнейВМесяце,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ОтветственныйВладелец,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.Бойлер,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.НеЖивут,
		|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет.КодКОАТУУ
		|ИЗ
		|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(&КонПериода, Действует = ИСТИНА) КАК УстановленныеПриборыУчетаСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
		|				&КонПериода,
		|				Действует = ЛОЖЬ
		|					И ЕСТЬNULL(СреднемесячноеПоказание, 0) <> 0) КАК НАПоверке
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = НАПоверке.ОбъектУстановки
		|			И УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = НАПоверке.ПриборУчета
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
		|		ПО УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет
		|ГДЕ
		|	НАПоверке.СреднемесячноеПоказание <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОбъектУстановки";
		
	Запрос.Параметры.Вставить("НачПериода", НачалоМесяца(Объект.ПериодНачисления));
	Запрос.Параметры.Вставить("КонПериода", КонецМесяца(Объект.ПериодНачисления));

	//Запрос.Параметры.Вставить("Здание", стр.Здание);
	//Запрос.Параметры.Вставить("Услуга", Объект.Услуга);
	Запрос.Параметры.Вставить("Ссылка", Объект.Ссылка);
	
	
	Результат  = Запрос.ВыполнитьПакет();
	
	ВыборкаЛС = Результат[4].Выбрать(); 
	ВыборкаПоверок = Результат[5].Выбрать();
	Разница = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ЛицевыеСчета.Ссылка КАК Ссылка
	                |ИЗ
	                |	Справочник.ЛицевыеСчета КАК ЛицевыеСчета
					//|ГДЕ
					//|	ЛицевыеСчета.Владелец = &Здание
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Ссылка";
	//Запрос.УстановитьПараметр("Здание",стр.Здание);				 
	МассивОбъектовУстановки = ЗАпрос.Выполнить().Выгрузить();
	Пока ВыборкаЛС.Следующий() Цикл
		//Если ВыборкаЛС.Услуга.ВидУслуги = Справочники.ВидыУслуг.ХолоднаяВода Тогда			
			НоваяСтрока = Объект.Показания.Добавить();
			НоваяСтрока.Здание = ВыборкаЛС.ОбъектУстановки.Владелец;
			НоваяСтрока.ЛицевойСчет = ВыборкаЛС.ОбъектУстановки;
			НоваяСтрока.ПриборУчета = ВыборкаЛС.ПриборУчета;
			НоваяСтрока.ПоказаниеПредыдущее = ВыборкаЛС.ПоказаниеПредыдущее;
			НоваяСтрока.Показание = ВыборкаЛС.Показание;
			НоваяСтрока.Коэффициент = ВыборкаЛС.Коэффициент;
			НоваяСтрока.Отключен = ВыборкаЛС.Отключен;
			НоваяСтрока.ВидТарифа = ВыборкаЛС.ВидТарифа;
			НоваяСтрока.Услуга = ВыборкаЛС.Услуга;
			НоваяСтрока.ОбъектЛицевогоСчета = ВыборкаЛС.ОбъектЛицевогоСчета;
			НоваяСтрока.ОтветственныйВладелец = ВыборкаЛС.ОтветственныйВладелец;
			НоваяСтрока.Разница = НоваяСтрока.Показание - НоваяСтрока.ПоказаниеПредыдущее;
			НоваяСтрока.Бойлер = ВыборкаЛС.ОбъектУстановки.Бойлер;
			НоваяСтрока.НеЖивут = ВыборкаЛС.ОбъектУстановки.НеЖивут;
			НоваяСтрока.КодКОАТУУ = ВыборкаЛС.ОбъектУстановки.КодКОАТУУ;
		//КонецЕсли;		
	КонецЦикла;
	
	Для Индекс = 0 По (ЧИСЛО(МассивОбъектовУстановки.Количество())-1) Цикл
	
		НайденаПоверка = ВыборкаПоверок.НайтиСледующий(МассивОбъектовУстановки[Индекс].Ссылка);
		Если НайденаПоверка и ВыборкаПоверок.ДнейПоСредней <> 0 Тогда
			
		     
				НоваяСтрока = Объект.Показания.Добавить();
				НоваяСтрока.ЛицевойСчет = ВыборкаПоверок.ОбъектУстановки;
				НоваяСтрока.ПриборУчета = ВыборкаПоверок.ПриборУчета;
				НоваяСтрока.Коэффициент = ВыборкаПоверок.ПриборУчета.Коэффициент;
				НоваяСтрока.Отключен = Истина;
				НоваяСтрока.ВидТарифа = Перечисления.ВидыТарифов.Общий;
				НоваяСтрока.Услуга =  ВыборкаПоверок.ПриборУчета.Услуга;
				НоваяСтрока.ОбъектЛицевогоСчета = ВыборкаПоверок.ОбъектУстановки.ОбъектЛицевогоСчета;
				НоваяСтрока.ОтветственныйВладелец = ВыборкаПоверок.ОтветственныйВладелец;
				Разница = (ВыборкаПоверок.СреднемесячноеПоказание/(ВыборкаПоверок.ДнейВМесяце+1))*ВыборкаПоверок.ДнейПоСредней;
				НоваяСтрока.Разница =  Разница;

		 КонецЕсли;  
	
	КонецЦикла; 
		
	Объект.Показания.Сортировать("ЛицевойСчет, ПриборУчета, Отключен Убыв");   
	
	Для каждого СтрокаОсновная Из Объект.Показания Цикл
		
		Если СтрокаОсновная.Показание = 0 Тогда
			Продолжить;
		КонецЕсли; 
		
		СтруктураДанные = Новый Структура();
		СтруктураДанные.Вставить("ПриборУчета", СтрокаОсновная.ПриборУчета);
		СтруктураДанные.Вставить("ПредыдущееПоказание", СтрокаОсновная.ПоказаниеПредыдущее);
		СтруктураДанные.Вставить("ТекущееПоказание", СтрокаОсновная.Показание);
		
		СтруктураДанные = ПолучитьДанныеОсновнаяПоказаниеПриИзменении(СтруктураДанные);
		
		СтрокаОсновная.Разница = СтруктураДанные.РасходПоПриборуУчета;
		СтрокаОсновная.ПереходЧерезНоль = СтруктураДанные.ЕстьПереходПоказанийЧерезНоль;
		СтрокаОсновная.РасходЗаПериодРасчета = СтруктураДанные.РасходЗаПериодРасчета;
	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвтоматически(Команда)
	Состояние(НСтр("ru='Идет заполнение ..."
"Пожалуйста, подождите.';uk='Йде заповнення ..."
"Будь ласка, зачекайте.'"));
	
	Объект.Показания.Очистить();
	ЗаполнитьАвтоматическиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокНеЗаполненыхНаСервере(ТабДок)
	Макет = Документы.ВводПоказанийПриборовЗаМесяц.ПолучитьМакет("МакетНезаполненных");
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет КАК ЛицевойСчет,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПриборУчета,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПоказаниеПредыдущее,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Показание,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Бойлер,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.НеЖивут,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира
	    |ИЗ
	    |	Документ.ВводПоказанийПриборовЗаМесяц.Показания КАК ВводПоказанийПриборовЗаМесяцПоказания
	    |ГДЕ
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Разница < 0
	    |	И ВводПоказанийПриборовЗаМесяцПоказания.Ссылка.Ссылка = &ЭтотДокумент
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ЭтотДокумент", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	
	ТабДок.Очистить();
	ОбластьШапка.Параметры.ПериодНачисления = Объект.ПериодНачисления;
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьДанные.Параметры.Номер = 0;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбластьДанные.Параметры.Номер = ОбластьДанные.Параметры.Номер + 1;
		ОбластьДанные.Параметры.ЛицевойСчет = Выборка.ЛицевойСчет;
		ОбластьДанные.Параметры.Адрес = Строка(Выборка.ЛицевойСчет.Владелец) + " " + Строка(Выборка.Квартира);
		ОбластьДанные.Параметры.ПриборУчета = Выборка.ПриборУчета;
		ОбластьДанные.Параметры.ПоказаниеПредыдущее = Выборка.ПоказаниеПредыдущее;
		ОбластьДанные.Параметры.Показание = Выборка.Показание;
		ОбластьДанные.Параметры.Бойлер = Выборка.Бойлер;
		ОбластьДанные.Параметры.НеЖивут = Выборка.НеЖивут;
		ОбластьДанные.Параметры.Телефон = Выборка.ЛицевойСчет.МобТелефон;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокНеЗаполненых(Команда)
	ТабДок = Новый ТабличныйДокумент;
	
	СписокНеЗаполненыхНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПустыеПоказанияНаСервере()
	тзПоказания = Объект.Показания.Выгрузить();
	Для Каждого Строка Из тзПоказания Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Здание) Тогда
			Продолжить;
		ИначеЕсли НЕ ЗначениеЗаполнено(Строка.Показание) ИЛИ Строка.Показание < Строка.ПоказаниеПредыдущее Тогда
			Если Строка.НеЖивут = Истина И Строка.Бойлер = Истина И Строка.Услуга.ВидУслуги = Справочники.ВидыУслуг.ГорячаяВода Тогда 
			    Строка.Показание = Строка.ПоказаниеПредыдущее;
		        Строка.Разница = 0;
				Строка.НачислениеПоСреднему = Ложь;
			ИначеЕсли Строка.НеЖивут = Истина И Строка.Бойлер = Ложь Тогда
				Строка.Показание = Строка.ПоказаниеПредыдущее;
		        Строка.Разница = 0;
				Строка.НачислениеПоСреднему = Ложь;
			ИначеЕсли Строка.НеЖивут = Ложь И Строка.Бойлер = Истина И Строка.Услуга.ВидУслуги = Справочники.ВидыУслуг.ГорячаяВода Тогда
				Строка.Показание = Строка.ПоказаниеПредыдущее;
		        Строка.Разница = 0;
				Строка.НачислениеПоСреднему = Ложь;
			Иначе
				Среднее = ВыбратьСреднийПоказатель(Строка.ПриборУчета);
				КвоКубовСреднее  = Число(Среднее);
				
				Если КвоКубовСреднее = "" ИЛИ КвоКубовСреднее < 0 Тогда
					КвоКубовСреднее = Число(0);
				КонецЕсли;
				Строка.Показание = Формат(Число(Строка.ПоказаниеПредыдущее) + Число(КвоКубовСреднее), "ЧЦ=12; ЧДЦ=3");
				Строка.Разница   = Формат(КвоКубовСреднее, "ЧЦ=12; ЧДЦ=3");
				Строка.НачислениеПоСреднему = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Объект.Показания.Загрузить(тзПоказания);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеПоказания(Команда)
	
	ЗаполнитьПустыеПоказанияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПоказаниеПриИзменении(Элемент)
	ТекСтрока = Элементы.Показания.ТекущиеДанные;
	ТекСтрока.Разница = ТекСтрока.Показание - ТекСтрока.ПоказаниеПредыдущее;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = Справочники.Организации.НайтиПоКоду("000000001");
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Пользователь = ПроверкаРоли();
	Если Объект.Дата < НачалоМесяца(ТекущаяДата()) И НЕ Пользователь = "Администратор" И Объект.Проведен = Истина Тогда
	    ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокСНулевымиПоказаниямиНаСервере(ТабДок)
	Макет = Документы.ВводПоказанийПриборовЗаМесяц.ПолучитьМакет("МакетНезаполненных");
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет КАК ЛицевойСчет,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПриборУчета,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПоказаниеПредыдущее,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Показание,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Бойлер,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.НеЖивут,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира
	    |ИЗ
	    |	Документ.ВводПоказанийПриборовЗаМесяц.Показания КАК ВводПоказанийПриборовЗаМесяцПоказания
	    |ГДЕ
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Ссылка.Ссылка = &ЭтотДокумент
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	ЛицевойСчет
	    |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ЭтотДокумент", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	
	ТабДок.Очистить();
	ОбластьШапка.Параметры.ПериодНачисления = Объект.ПериодНачисления;
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьДанные.Параметры.Номер = 0;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПоказаниеПредыдущее = Выборка.Показание Тогда
			ОбластьДанные.Параметры.Номер = ОбластьДанные.Параметры.Номер + 1;
			ОбластьДанные.Параметры.ЛицевойСчет = Выборка.ЛицевойСчет;
			ОбластьДанные.Параметры.Адрес = Выборка.ЛицевойСчет.Владелец + " " + Выборка.Квартира;
			ОбластьДанные.Параметры.ПриборУчета = Выборка.ПриборУчета;
			ОбластьДанные.Параметры.ПоказаниеПредыдущее = Выборка.ПоказаниеПредыдущее;
			ОбластьДанные.Параметры.Показание = Выборка.Показание;
			ОбластьДанные.Параметры.Бойлер = Выборка.Бойлер;
		    ОбластьДанные.Параметры.НеЖивут = Выборка.НеЖивут;
			ОбластьДанные.Параметры.Телефон = Выборка.ЛицевойСчет.МобТелефон;
			ТабДок.Вывести(ОбластьДанные);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокСНулевымиПоказаниями(Команда)
	ТабДок = Новый ТабличныйДокумент;
	СписокСНулевымиПоказаниямиНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура СписокСЗанесеннымиПоказаниямиНаСервере(ТабДок)
	Макет = Документы.ВводПоказанийПриборовЗаМесяц.ПолучитьМакет("МакетНезаполненных");
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет КАК ЛицевойСчет,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПриборУчета,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПоказаниеПредыдущее,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Показание,
	    |	СУММА(ВводПоказанийПриборовЗаМесяцПоказания.Показание - ВводПоказанийПриборовЗаМесяцПоказания.ПоказаниеПредыдущее) КАК Разница,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Бойлер,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.НеЖивут,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет.ОбъектЛицевогоСчета КАК Квартира
	    |ИЗ
	    |	Документ.ВводПоказанийПриборовЗаМесяц.Показания КАК ВводПоказанийПриборовЗаМесяцПоказания
	    |ГДЕ
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Разница > 0
	    |	И ВводПоказанийПриборовЗаМесяцПоказания.Ссылка.Ссылка = &ЭтотДокумент
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ЛицевойСчет,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПриборУчета,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.ПоказаниеПредыдущее,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Показание,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.Бойлер,
	    |	ВводПоказанийПриборовЗаМесяцПоказания.НеЖивут
	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	Разница УБЫВ
	    |АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ЭтотДокумент", Объект.Ссылка);
	Результат = Запрос.Выполнить();
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	
	ТабДок.Очистить();
	ОбластьШапка.Параметры.ПериодНачисления = Объект.ПериодНачисления;
	ТабДок.Вывести(ОбластьШапка);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьДанные.Параметры.Номер = 0;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбластьДанные.Параметры.Номер = ОбластьДанные.Параметры.Номер + 1;
		ОбластьДанные.Параметры.ЛицевойСчет = Выборка.ЛицевойСчет;
		ОбластьДанные.Параметры.Адрес = Строка(Выборка.ЛицевойСчет.Владелец) + " " + Строка(Выборка.Квартира);
		ОбластьДанные.Параметры.ПриборУчета = Выборка.ПриборУчета;
		ОбластьДанные.Параметры.ПоказаниеПредыдущее = Выборка.ПоказаниеПредыдущее;
		ОбластьДанные.Параметры.Показание = Выборка.Показание;
		ОбластьДанные.Параметры.Разница = Выборка.Показание - Выборка.ПоказаниеПредыдущее;
		ОбластьДанные.Параметры.Бойлер = Выборка.Бойлер;
		ОбластьДанные.Параметры.НеЖивут = Выборка.НеЖивут;
		ОбластьДанные.Параметры.Телефон = Выборка.ЛицевойСчет.МобТелефон;
		ТабДок.Вывести(ОбластьДанные);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СписокСЗанесеннымиПоказаниями(Команда)
	ТабДок = Новый ТабличныйДокумент;
	СписокСЗанесеннымиПоказаниямиНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Функция ВыбратьСреднийПоказатель(ПриборУчета);
	КонПериода = КонецМесяца(ДобавитьМесяц(КонецМесяца(Объект.ПериодНачисления), -1));
	НачПериода = ДобавитьМесяц(НачалоМесяца(Объект.ПериодНачисления), -12);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ПоказанияПриборовЗаМесяц.Разница
	    |ИЗ
	    |	РегистрСведений.ПоказанияПриборовЗаМесяц КАК ПоказанияПриборовЗаМесяц
	    |ГДЕ
	    |	ПоказанияПриборовЗаМесяц.Период МЕЖДУ &НачалоПериода И &КонецПериода
	    |	И ПоказанияПриборовЗаМесяц.ПриборУчета = &ПриборУчета";
		//"ВЫБРАТЬ
		//|	РасчетПоказанийПриборовУчета.Значение
		//|ИЗ
		//|	РегистрНакопления.РасчетПоказанийПриборовУчета КАК РасчетПоказанийПриборовУчета
		//|ГДЕ
		//|	РасчетПоказанийПриборовУчета.ПриборУчета = &ПриборУчета
		//|	И РасчетПоказанийПриборовУчета.Период МЕЖДУ &НачПериода И &КонПериода";

	Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Запрос.УстановитьПараметр("КонецПериода", ДобавитьМесяц(КонецМесяца(ТекущаяДата()), -1));
	Запрос.УстановитьПараметр("НачалоПериода", ДобавитьМесяц(НачалоМесяца(ТекущаяДата()), -12));
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		//Продолжить;
	Иначе
		Показ = 0;
		Для Каждого стр Из Результат Цикл
			Показ = Показ + стр.Разница;
		КонецЦикла;
		ПоказОбщий = Показ / Результат.Количество();
	КонецЕсли;
	Если ПоказОбщий = Неопределено Тогда
		ПоказОбщий = 0;
	КонецЕсли;
	Возврат ПоказОбщий;
КонецФункции

&НаСервере
Функция ПроверкаРоли()
    Пользователь = ПараметрыСеанса.ТекущийПользователь.Наименование;
	Возврат Пользователь;
КонецФункции
